# Assignment 10 - Python Pandas

In [ ]:
## Importing Packages 
import pandas as pd

In [3]:
## Loading data 
data = pd.read_csv('EmployeeAttrition.csv')
data.head()

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1,...,1,80,0,8,0,1,6,4,0,5
1,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences,1,2,...,4,80,1,10,3,3,10,7,1,7
2,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,1,4,...,2,80,0,7,3,3,0,0,0,0
3,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,1,5,...,3,80,0,8,3,3,8,7,3,0
4,27,No,Travel_Rarely,591,Research & Development,2,1,Medical,1,7,...,4,80,1,6,3,3,2,2,2,2

### Q1: Find the number of entries/rows and columns in the data.

In [4]:
data.shape
print("Number of rows in the data : {} ".format(data.shape[0]))
print("Number of columns in the data : {} ".format(data.shape[1]))

Number of rows in the data : 1470
Number of columns in the data : 35

### Q2: What is the average Monthly Income?

In [10]:
MonthlyIncomeMean = data['MonthlyIncome'].mean()
print('The average monthly income is :  {}'.format(round(MonthlyIncomeMean, 2)))

The average monthly income is :  6502.93

### Q3: What is the highest amount of HourlyRate ?

In [12]:
HourlyRateMax = data.HourlyRate.max()
print('The highest amount of HourlyRate is  :  {}'.format(HourlyRateMax))

The highest amount of HourlyRate is  :  100

### Q4: What is the Department, JobRole, MaritalStatus and OverTime of EmployeeNumber 10?

In [16]:
data[data.EmployeeNumber == 10][['EmployeeNumber' , 'Department', 'JobRole' , 'MaritalStatus' , 'OverTime']]

,EmployeeNumber,Department,JobRole,MaritalStatus,OverTime
6,10,Research & Development,Laboratory Technician,Married,Yes

### Q5: What is the Employee ID of highest MonthlyIncome paid employee?

In [31]:
empl_id = data[data.MonthlyIncome == data.MonthlyIncome.max()][['EmployeeNumber']]


print('The Employee ID of highest Monthly Income employee is {}'.format(empl_id.EmployeeNumber.values[0]))

empl_id

The Employee ID of highest Monthly Income employee is 259

     EmployeeNumber
190             259

### Q6: What is the average(mean) DailyRate group by Age for all Employees whose age is greater than 58. (hint: use groupby function)

In [36]:
df = data.groupby(['Age']).mean()[['DailyRate']].reset_index()
df[df.Age > 58]

    Age  DailyRate
41   59      992.3
42   60      833.2

### Q7: How many unique EducationField are there?

In [40]:
data.EducationField.nunique()
print('The total unique EducationField in the data are : {}'.format(data.EducationField.nunique()))

The total unique EducationField in the data are : 6

### Q8:  What are the top 5 most common JobRole?

In [50]:
df = data.groupby('JobRole').sum()[['EmployeeCount']].reset_index()
df.sort_values('EmployeeCount' , ascending= False).head(5)

                     JobRole  EmployeeCount
7            Sales Executive            326
6         Research Scientist            292
2      Laboratory Technician            259
4     Manufacturing Director            145
0  Healthcare Representative            131

### Q9: How many JobRoles represented by less than 100 employees?

In [53]:
df = data.groupby('JobRole').sum()[['EmployeeCount']].reset_index()
df[df.EmployeeCount < 100]

                JobRole  EmployeeCount
1       Human Resources             52
5     Research Director             80
8  Sales Representative             83

### Q10: What is the correlation between Education and JobSatisfaction?

In [56]:
data[['Education' , 'JobSatisfaction']].corr()

                 Education  JobSatisfaction
Education         1.000000        -0.011296
JobSatisfaction  -0.011296         1.000000